{
  "slug": "still-becoming",
  "en": {
    "title": "Still Becoming",
    "subtitle": "Note 01 - A personal note from somewhere in between.",
    "date": "2025-07-08",
    "paragraphs": [
      "A quiet and personal note from somewhere in between.This isn’t an answer — just a small attempt to make sense of where I am.",
      "I’ve never had a strong sense of who I’m meant to become.",
      "Not like the ones who seem to move with purpose — drawn forward by something clear, something named.",
      "For me, it’s always been quieter than that.",
      "More like wandering than following.",
      "Not aimless — just open.",
      "Full of questions I’m still learning how to hold.",
      "What I do know is: I want to grow.",
      "To discover more — about the world, about people, about myself.",
      "To live a life that feels real and fully mine.",
      "Not one I fell into by accident, or inherited without meaning to.",
      "I went to Singapore looking for adventure. For excitement.",
      "And I found some — new friends, new experiences, a life that was different.",
      "For a while, it gave me what I needed — movement, novelty, energy.",
      "But something in me stayed restless.",
      "Over time, I started to feel distant from myself there.",
      "Like I was watching my life from just outside it.",
      "So I left.",
      "Returning to France felt like a breath.",
      "A kind of exhale I didn’t know I was holding.",
      "Paris still feels like home. It’s familiar, grounding — maybe the best place I know to just be.",
      "But I’ve started to wonder if that’s the trap.",
      "Because comfort, while beautiful, can be quietly dangerous.",
      "It tempts you to settle. To grow still. To stop looking around.",
      "And I know myself well enough to see the risk in that.",
      "If I stay too long, I might stop surprising myself.",
      "Paris has a mood that’s hard to pin down — somewhere between elegance and chaos.",
      "It mesmerizes you with beauty, then quietly leaves you unsure where you stand.",
      "And as much as I love it, I know I can’t stay still here.",
      "So I’m leaving again — this time, to Japan.",
      "Not with urgency, but with intention.",
      "Because Japan isn’t just a new place. It’s a place that’s lived quietly inside me for years.",
      "I’ve been there before. I have friends there.",
      "It’s familiar — but something about it still feels unresolved.",
      "Like a version of myself I once touched, then left unfinished.",
      "Going back isn’t escape.",
      "It’s return. It’s curiosity.",
      "**It’s a step toward the parts of me I’ve yet to meet.**",
      "There are moments when I throw myself forward — not because I’m sure, but because standing still scares me more.",
      "Stillness, while calm on the surface, can quietly become a cage.",
      "A slow settling into something that no longer reflects who I am — or who I hope to be.",
      "Taking a step — even into the unknown — reminds me I’m still becoming.",
      "It brings my thoughts back into motion.",
      "It forces me to feel again: the nerves, the curiosity, the resistance, the thrill.",
      "Maybe it’s not bravery — maybe it’s restlessness.",
      "**Maybe it’s a refusal to believe that the version of me today is all there is.**",
      "Or maybe it’s how I hold on to hope — that change, movement, discomfort might reveal something I’ve been missing.",
      "Along the way, I’ve crossed paths with many people. Some who stayed. Others I’m still thinking about.",
      "And while nothing has lasted in the way I once imagined, each connection has shaped how I see the world — and myself.",
      "I’m not building toward some perfect version of myself.",
      "Just trying to become someone I understand a little more over time — someone I can stand behind.",
      "Not because I got everything right,",
      "But because I kept moving.",
      "Kept asking.",
      "Kept showing up — even when I wasn’t sure why.",
      "Even if the journey never really finishes —",
      "Even if it stays messy, imperfect, or quiet —",
      "It will still be mine.",
      "**And maybe that’s enough.**"
    ]
  }
} 