{
  "slug": "still-becoming",
  "en": {
    "title": "Still Becoming",
    "subtitle": "Note 01 - A personal note from somewhere in between.",
    "date": "2025-07-08",
    "paragraphs": [
      "A quiet and personal note from somewhere in between. This isn’t an answer — just a small attempt to make sense of where I am.",
      "I’ve never had a strong sense of who I’m meant to become.",
      "Not like the ones who seem to move with purpose — drawn forward by something clear, something named.",
      "For me, it’s always been quieter than that.",
      "More like wandering than following.",
      "Not aimless — just open.",
      "Full of questions I’m still learning how to hold.",
      "What I do know is: I want to grow.",
      "To discover more — about the world, about people, about myself.",
      "To live a life that feels real and fully mine.",
      "Not one I fell into by accident, or inherited without meaning to.",
      "I went to Singapore looking for adventure. For excitement.",
      "And I found some — new friends, new experiences, a life that was different.",
      "For a while, it gave me what I needed — movement, novelty, energy.",
      "But something in me stayed restless.",
      "Over time, I started to feel distant from myself there.",
      "Like I was watching my life from just outside it.",
      "So I left.",
      "Returning to France felt like a breath.",
      "A kind of exhale I didn’t know I was holding.",
      "Paris still feels like home. It’s familiar, grounding — maybe the best place I know to just be.",
      "But I’ve started to wonder if that’s the trap.",
      "Because comfort, while beautiful, can be quietly dangerous.",
      "It tempts you to settle. To grow still. To stop looking around.",
      "And I know myself well enough to see the risk in that.",
      "If I stay too long, I might stop surprising myself.",
      "Paris has a mood that’s hard to pin down — somewhere between elegance and chaos.",
      "It mesmerizes you with beauty, then quietly leaves you unsure where you stand.",
      "And as much as I love it, I know I can’t stay still here.",
      "So I’m leaving again — this time, to Japan.",
      "Not with urgency, but with intention.",
      "Because Japan isn’t just a new place. It’s a place that’s lived quietly inside me for years.",
      "I’ve been there before. I have friends there.",
      "It’s familiar — but something about it still feels unresolved.",
      "Like a version of myself I once touched, then left unfinished.",
      "Going back isn’t escape.",
      "It’s return. It’s curiosity.",
      "**It’s a step toward the parts of me I’ve yet to meet.**",
      "There are moments when I throw myself forward — not because I’m sure, but because standing still scares me more.",
      "Stillness, while calm on the surface, can quietly become a cage.",
      "A slow settling into something that no longer reflects who I am — or who I hope to be.",
      "Taking a step — even into the unknown — reminds me I’m still becoming.",
      "It brings my thoughts back into motion.",
      "It forces me to feel again: the nerves, the curiosity, the resistance, the thrill.",
      "Maybe it’s not bravery — maybe it’s restlessness.",
      "**Maybe it’s a refusal to believe that the version of me today is all there is.**",
      "Or maybe it’s how I hold on to hope — that change, movement, discomfort might reveal something I’ve been missing.",
      "Along the way, I’ve crossed paths with many people. Some who stayed. Others I’m still thinking about.",
      "And while nothing has lasted in the way I once imagined, each connection has shaped how I see the world — and myself.",
      "I’m not building toward some perfect version of myself.",
      "Just trying to become someone I understand a little more over time — someone I can stand behind.",
      "Not because I got everything right,",
      "But because I kept moving.",
      "Kept asking.",
      "Kept showing up — even when I wasn’t sure why.",
      "Even if the journey never really finishes —",
      "Even if it stays messy, imperfect, or quiet —",
      "It will still be mine.",
      "**And maybe that’s enough.**"
    ]
  },
  "fr": {
    "title": "En Devenir",
    "subtitle": "Note 01 – Une note personnelle et silencieuse, écrite quelque part entre deux étapes.",
    "date": "2025-07-08",
    "paragraphs": [
        "Une note personnelle et silencieuse, écrite quelque part entre deux étapes. Ce n’est pas une réponse — juste une note, écrite pour voir plus clair.",
        "Je n’ai jamais su clairement qui j’étais censé devenir.",
        "Pas comme ceux qui semblent nés avec un cap, ou qui finissent par en trouver un.",
        "Pour moi, ça a toujours été plus flou.",
        "Plus proche de l’errance que du chemin balisé.",
        "Pas perdu — mais ouvert.",
        "Rempli de questions que je garde ouvertes, parfois sans savoir comment les poser.",
        "Ce que je sais, c’est que je veux grandir.",
        "Découvrir davantage — sur le monde, les autres, moi-même.",
        "Vivre une vie qui me ressemble profondément, pas simplement celle qui se serait construite sans moi.",
        "Je suis allé à Singapour en cherchant l’aventure. L’excitation.",
        "Et j’en ai trouvé : de nouvelles amitiés, des expériences inédites, une vie différente.",
        "Pendant un temps, c’est ce dont j’avais besoin — du mouvement, de la nouveauté, de l’énergie.",
        "Mais quelque chose en moi est resté agité.",
        "J’ai commencé à me sentir en décalage, comme si quelque chose en moi ne suivait plus.",
        "Comme si ma vie continuait sans que je sois vraiment dedans.",
        "Alors je suis parti.",
        "Revenir en France, c’était comme respirer à nouveau.",
        "Paris reste sans doute l’endroit où je me sens le plus chez moi.",
        "C’est familier, apaisant — un lieu où je peux être moi, tout entier, sans avoir à chercher la bonne version.",
        "Et c’est peut-être ça qui me trouble.",
        "Parce que le confort, aussi doux soit-il, finit parfois par endormir ce qui nous pousse à bouger.",
        "Il rend les jours répétitifs. Les questions plus lointaines.",
        "Et je sais que si je m’y installe trop longtemps, je risque d’oublier ce que c’est que me surprendre.",
        "Paris a une énergie étrange, quelque part entre l’élégance et le désordre.",
        "Elle charme par sa beauté, puis te laisse doucement incertain de ta place.",
        "Et même si je l’aime, je ne suis pas encore prêt à m’y reposer.",
        "Alors je repars — cette fois, vers le Japon.",
        "Pas avec urgence, mais avec intention.",
        "Parce que ce n’est pas simplement une nouvelle destination.",
        "C’est un lieu qui vit en moi depuis des années.",
        "J’y suis déjà allé. J’ai des amis là-bas.",
        "C’est familier — mais il y a là-bas une version de moi que je n’ai jamais vraiment terminée.",
        "Comme une partie restée en suspens.",
        "Y retourner, ce n’est pas fuir.",
        "C’est revenir. C’est chercher.",
        "**C’est avancer vers les parties de moi que je ne connais pas encore.**",
        "Il y a des moments où je me projette en avant — non pas par certitude, mais parce que l’immobilité me fait plus peur.",
        "Le calme apparent peut facilement devenir une cage.",
        "Une lente installation dans une version de moi qui ne me ressemble plus.",
        "Faire un pas — même dans l’inconnu — me rappelle que je suis encore en train de me construire.",
        "Ça remet mes pensées en mouvement.",
        "Ça me fait ressentir à nouveau : les nerfs, la curiosité, la résistance, l’élan.",
        "Peut-être que ce n’est pas du courage — peut-être juste de l’impatience.",
        "**Peut-être que c’est refuser de croire que la version de moi aujourd’hui est tout ce qu’il y a.**",
        "Ou peut-être que c’est ma façon de garder espoir — que le changement, le mouvement, l’inconfort puissent révéler quelque chose qui me manque.",
        "Sur le chemin, j’ai croisé beaucoup de personnes.",
        "Certaines sont restées. D’autres me reviennent encore parfois en mémoire.",
        "Et même si rien n’a duré comme je l’aurais imaginé, chaque rencontre a changé la façon dont je regarde le monde — et moi-même.",
        "Je ne cherche pas à devenir une version parfaite de moi-même.",
        "Je veux juste devenir quelqu’un que je comprends un peu mieux avec le temps.",
        "Quelqu’un que je peux soutenir.",
        "Pas parce que j’ai tout bien fait,",
        "Mais parce que j’ai continué à avancer.",
        "À poser des questions.",
        "À me montrer — même quand je ne savais pas exactement pourquoi.",
        "Même si ce chemin ne s’achève jamais vraiment —",
        "Même s’il reste flou, imparfait, silencieux —",
        "Il sera toujours le mien.",
        "**Et peut-être que c’est suffisant — tant que je continue d’avancer.**"
      ]
    }
  }
